sophgo/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/drivers/cmsis/Device/HDSC/hc32f4xx/Source/GCC/svd/HDSC_HC32F4A0.svd
                <register>
                    <name>ECC_SYND15_0</name>
                    <description>desc ECC_SYND15_0</description>
                    <addressOffset>0x8170</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S1</name>
                            <description>desc S1</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S2</name>
                            <description>desc S2</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECC_SYND15_1</name>
                    <description>desc ECC_SYND15_1</description>
                    <addressOffset>0x8174</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S3</name>
                            <description>desc S3</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S4</name>
                            <description>desc S4</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECC_SYND15_2</name>
                    <description>desc ECC_SYND15_2</description>
                    <addressOffset>0x8178</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S5</name>
                            <description>desc S5</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S6</name>
                            <description>desc S6</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECC_SYND15_3</name>
                    <description>desc ECC_SYND15_3</description>
                    <addressOffset>0x817C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S7</name>
                            <description>desc S7</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S8</name>
                            <description>desc S8</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>OTS</name>
            <description>desc OTS</description>
            <baseAddress>0x40010600</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x3A20C</size>
            </addressBlock>
            <registers>
                <register>
                    <name>PDR1</name>
                    <description>desc PDR1</description>
                    <addressOffset>0xE0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TSPD1</name>
                            <description>desc TSPD1</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSPD2</name>
                            <description>desc TSPD2</description>
                            <msb>31</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PDR2</name>
                    <description>desc PDR2</description>
                    <addressOffset>0xF4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TSPD1</name>
                            <description>desc TSPD1</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSPD2</name>
                            <description>desc TSPD2</description>
                            <msb>31</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PDR3</name>
                    <description>desc PDR3</description>
                    <addressOffset>0xF8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TSPD1</name>
                            <description>desc TSPD1</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSPD2</name>
                            <description>desc TSPD2</description>
                            <msb>31</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTL</name>
                    <description>desc CTL</description>
                    <addressOffset>0x3A200</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>OTSST</name>
                            <description>desc OTSST</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OTSCK</name>
                            <description>desc OTSCK</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OTSIE</name>
                            <description>desc OTSIE</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSSTP</name>
                            <description>desc TSSTP</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DR1</name>
                    <description>desc DR1</description>
                    <addressOffset>0x3A202</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>DR2</name>
                    <description>desc DR2</description>
                    <addressOffset>0x3A204</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>ECR</name>
                    <description>desc ECR</description>
                    <addressOffset>0x3A206</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>LPR</name>
                    <description>desc LPR</description>
                    <addressOffset>0x3A208</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TSOFS</name>
                            <description>desc TSOFS</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TSSLP</name>
                            <description>desc TSSLP</description>
                            <msb>31</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
